[{
        "name": "Avocado & Egg Sandwich",
        "ingredients": "4 slices bacon  2 tablespoons butter, room temperature  4 slices wheat bread, toasted  4 ounces cream cheese, room temperature  1 teaspoon minced fresh parsley leaves  1 teaspoon minced green onion  1/8 teaspoon salt  1/8 teaspoon ground black pepper  2 large eggs  4 slices tomato  1/2 avocado, peeled, pitted, and sliced",
        "procedure": "In a small skillet, cook bacon over medium-high heat until crispy. Remove from pan, and drain on paper towels. Drain grease from pan, reserving 1 tablespoon. Spread butter over each side of bread. Place 4 slices of bread, butter side down, on skillet over medium heat. Flip bread and toast the other side. Remove to serving plates. In a small bowl, add cream cheese, parsley and green onions together. Add salt and pepper. Spread onto 1 side of each toast slice. In same small skillet, fry the eggs in reserved bacon grease over medium-low heat. Crack the yolks and flip. Place each egg on top of 2 pieces of toast. Cover each egg with 2 slices of bacon, 2 slices of tomato, and 2 slices of avocado. Top with another piece of toast and serve immediately.",
        "image": "https://images.unsplash.com/photo-1482049016688-2d3e1b311543?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=653&q=80"
    },
    {
        "name": "Banana French Toast",
        "ingredients": "8 thick slices blueberry banana yeast bread 4 large eggs 1 cup milk, whole or 2% 1 teaspoon pure vanilla extract 1/2 teaspoon ground cinnamon pinch kosher salt 1/2 teaspoon almond extract, optional",
        "procedure": "Whisk together eggs, milk, vanilla, cinnamon, salt, and optional almond extract until throughly blended. (Alternatively, use an immersion blender quickly pulse ingredients together). Pour into a shallow bowl wide enough for bread.  Preheat skillet. Set a large skillet over medium heat and melt about a tablespoon of butter. Working with one slice of bread at a time, dip bread into egg mixture*. Turn to coat other side of bread. Allow any excess liquid to drain. Cook bread on hot skillet until browned on one side, about 2 minutes. Before flipping, sprinkle two pinches of sugar on exposed side of bread. Flip and brown the other side, another 2 minutes. Repeat with remaining bread. Add additional butter to skillet as needed.  Immediately serve warm French toast with sliced bananas, fresh blueberries, and maple syrup",
        "image": "https://images.unsplash.com/photo-1484723091739-30a097e8f929?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=387&q=80"
    },
    {
        "name": "Butternut Squash Soup",
        "ingredients": "2 cups vegetable stock 4 cloves garlic peeled and minced 1 carrot peeled and roughly chopped 1 Granny Smith apple cored and roughly chopped 1 medium (about 3–4 lbs) butternut squash peeled, seeded and diced 1 white onion, peeled and roughly chopped 1 sprig fresh sage 1/2 teaspoon salt 1/4 teaspoon freshly-ground black pepper 1/8 teaspoon cayenne pinch of ground cinnamon and nutmeg 1/2 cup canned (unsweetened) coconut milk optional garnishes: extra coconut milk, smoked paprika, or see more ideas above",
        "procedure": "Cook it",
        "image": "https://images.unsplash.com/photo-1476718406336-bb5a9690ee2a?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=634&q=80"
    },
    {
        "name": "Flank Steak Tacos",
        "ingredients": "2 1/2 pounds flank steak For the Marinade 1/2 cup olive oil 1/3 cup tequila 2 Tablespoons triple sec 2 limes zest of one juice of both 3 cloves garlic minced 1/2 teaspoon chili powder For the Salsa 5 small tomatillos finely chopped 6 scallions white and light green parts sliced very thinly 1 jalapeño ribs and seeds removed then minced 1 medium cucumber (unpeeled) finely chopped juice of two limes (about 1/4 cup) 2 Tablespoons capers rinsed and chopped 3 cloves garlic minced 2 Tablespoons italian flat leaf parsley leaves finely chopped 2 Tablespoons cilantro leaves finely chopped",
        "procedure": "Marinate the Steak Whisk all marinade ingredients together in a small bowl Place steak in a large ziploc bag and pour marinade into it Seal bag and massage marinade around the meat to coat it Let marinate in the refrigerator for 4 hours up to overnight Make the Pico Combine all pico ingredients in serving bowl Taste and salt if necessary You may find the capers make it salty enough Drizzle with olive oil Cook the Steak In a large cast-iron skillet over medium-high flame melt about one Tablespoon of ghee (or your preferred fat) Remove steak from marinade and pat dry with a clean paper towel Place in skillet and brown on one side, about 4 to 5 minutes Then flip it and insert meat thermometer in the thickest part of the meat Cook until steak reaches an internal temperature of 130°F Remove to cutting board and let rest, tented with foil, for at least five minutes Cut on the bias into strips and serve with charred tortillas and pico verde.",
        "image": "https://images.unsplash.com/photo-1504544750208-dc0358e63f7f?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=375&q=80"
    }
]